In [1]:
import pandas as pd

### Now we will create 2 dataframes using dictionaries.

In [3]:
india_weather = pd.DataFrame({
    'city':['mumbai', 'banglore', 'delhi'],
    'humidity':[80,65,75],
    'temperature':[35,21,45]
})

In [4]:
india_weather

       city  humidity  temperature
0    mumbai        80           35
1  banglore        65           21
2     delhi        75           45

In [5]:
us_weather = pd.DataFrame({
    'city':['new york', 'chicago', 'orlando'],
    'humidity':[60,55,90],
    'temperature':[20,12,39]
})

In [6]:
us_weather

       city  humidity  temperature
0  new york        60           20
1   chicago        55           12
2   orlando        90           39

# pd.concat()

In [8]:
# Here we will concat these two dataframes by passing them as a list in concat() method.

df = pd.concat([india_weather, us_weather])    
df

       city  humidity  temperature
0    mumbai        80           35
1  banglore        65           21
2     delhi        75           45
0  new york        60           20
1   chicago        55           12
2   orlando        90           39

In [20]:
df.loc[0]

       city  humidity  temperature
0    mumbai        80           35
0  new york        60           20

In [17]:
# We can see index in copied as it is from parent dataframes. 
# This kind of index is a problem to access data.

df.index

Int64Index([0, 1, 2, 0, 1, 2], dtype='int64')

### pd.concat() with discarding parent dataframes's index

In [18]:
df2 = pd.concat([india_weather, us_weather], ignore_index=True)
df2

       city  humidity  temperature
0    mumbai        80           35
1  banglore        65           21
2     delhi        75           45
3  new york        60           20
4   chicago        55           12
5   orlando        90           39

In [23]:
df2.loc[0]

city           mumbai
humidity           80
temperature        35
Name: 0, dtype: object

In [24]:
df2.loc[4]

city           chicago
humidity            55
temperature         12
Name: 4, dtype: object

### column wise concat()

In [25]:
df3 = pd.concat([india_weather, us_weather], axis=1)
df3

       city  humidity  temperature      city  humidity  temperature
0    mumbai        80           35  new york        60           20
1  banglore        65           21   chicago        55           12
2     delhi        75           45   orlando        90           39

# Merge DataFrames

In [39]:
temp_df = pd.DataFrame({
    'city':['mumbai', 'delhi', 'haldwani', 'noida'],
    'temp':[30,45,30,40]
})

temp_df

       city  temp
0    mumbai    30
1     delhi    45
2  haldwani    30
3     noida    40

In [40]:
humidity_df = pd.DataFrame({
    'city':['delhi', 'mumbai', 'haldwani', 'banglore'],
    'humidity':[90,85,69,75]
})

humidity_df

       city  humidity
0     delhi        90
1    mumbai        85
2  haldwani        69
3  banglore        75

### merge by city column

In [44]:
df4 = pd.merge(temp_df, humidity_df, on='city')     # This is inner join
df4

       city  temp  humidity
0    mumbai    30        85
1     delhi    45        90
2  haldwani    30        69

In [42]:
# It will find the common city values in both dataframes and then merge them togehter.
# But there is problem we lost some data from temp_df. noida is not present in humidity_df so it has been droped.
# also banglore is droped.

# We can include noida in resultent dataframe by giving and extra argument how='outer'

### how='outer'

In [43]:
df5 = pd.merge(temp_df, humidity_df, on='city', how='outer')
df5

       city  temp  humidity
0    mumbai  30.0      85.0
1     delhi  45.0      90.0
2  haldwani  30.0      69.0
3     noida  40.0       NaN
4  banglore   NaN      75.0